import Mock from 'mockjs';

Mock.mock("orderDetail.php", "get", function() {
  return Mock.mock({
    "result":{
      "data": {
        "status": 2,
        "order_sn": "T180414622",
        "bike_sn": "800116",
        "mode|1-2": 1,
        "start_location": "北京市昌平区回龙观东大街",
        "end_location": "北京市海淀区奥林匹克公园",
        "city_id": 1,
        "mobile": "13598765645",
        "user_name": "@cname",
        "distance": 2000,
        "bike_gps": "116.398806,40.008637", 
        "total_time": 4000,
        "start_time": "@datetime",
        "end_time": "@datetime",
        "position_list": [
          {
            "lon": 116.361221,
            "lat": 40.043776
          },
          {
            "lon": 116.363736,
            "lat": 40.038086
          },
          {
            "lon": 116.364599,
            "lat": 40.036484
          },
          {
            "lon": 116.373438,
            "lat": 40.03538
          },
          {
            "lon": 116.377966,
            "lat": 40.036263
          },
          {
            "lon": 116.38084,
            "lat": 40.03654
          },
          {
            "lon": 116.38084,
            "lat": 40.033225
          },
          {
            "lon": 116.381343,
            "lat": 40.029413
          },
          {
            "lon": 116.381846,
            "lat": 40.021291
          },
          {
            "lon": 116.382637,
            "lat": 40.008084
          },
          {
            "lon": 116.377966,
            "lat": 40.036263
          },
          {
            "lon": 116.398806,
            "lat": 40.008637
          },
        ],
        "area": [
          {
            "lon": "116.274737",
            "lat": "40.139759",
            "ts": null
          },
          {
            "lon": "116.316562",
            "lat": "40.144943",
            "ts": null
          },
          {
            "lon": "116.351631",
            "lat": "40.129498",
            "ts": null
          },
          {
            "lon": "116.390582",
            "lat": "40.082481",
            "ts": null
          },
          {
            "lon": "116.38742",
            "lat": "40.01065",
            "ts": null
          },
          {
            "lon": "116.415297",
            "lat": "40.01181",
            "ts": null
          },
          {
            "lon": "116.696242",
            "lat": "40.964035",
            "ts": null
          },
          {
            "lon": "116.494498",
            "lat": "40.851306",
            "ts": null
          },
          {
            "lon": "116.238086",
            "lat": "40.848647",
            "ts": null
          },
          {
            "lon": "116.189454",
            "lat": "40.999418",
            "ts": null
          },
          {
            "lon": "116.244646",
            "lat": "40.990574",
            "ts": null
          },
          {
            "lon": "116.281441",
            "lat": "40.008703",
            "ts": null
          },
          {
            "lon": "116.271092",
            "lat": "40.142201",
            "ts": null
          },
          {
            "lon": "116.271092",
            "lat": "40.142201",
            "ts": null
          }
        ],
        "area_list": null,
        "npl_list": [
          {
            "id": 8625,
            "name": "北辰世纪中心",
            "city_id": 1,
            "type": 3,
            "status": 0,
            "map_point": "116.39338796444|40.008120315215;116.39494038009002|40.008177258745",
            "map_point_array":["116.39338796444|40.008120315215","116.396053|40.008273"],
            "map_status": 1,
            "creator_name": "赵程程",
            "creator_time": 1507863539000
          }
        ]
      }
    }
  });
});